"""
Реалізуй функцію product_list(), яка:

Отримує список чисел numbers, який:
містить не менше двох чисел, які можуть повторюватися;
містить тільки додатні числа.
Повертає список такого ж розміру, де кожен елемент дорівнює добутку усіх елементів 
списку справа і зліва від цього елемента.

"""
import math

def product_list(numbers: list) -> list:
    result_list = []
    for i in range(len(numbers)):
        new_list = numbers.copy()
        new_list.remove(numbers[i])
        result_list.append(math.prod(new_list))
    return result_list


if __name__ == "__main__":
    print(product_list([1, 5, 2]) == [10, 2, 5])

# Перший елемент 10 це добуток всіх елементів списку numbers, без першого елементу 1
# Другий елемент 2 це добуток всіх елементів списку numbers, без другого елементу 5
# Третій елемент 5 це добуток всіх елементів списку numbers, без третього елементу 2

    print(product_list([12, 20]) == [20, 12])

# Перший елемент 20 це добуток всіх елементів списку numbers, без першого елементу 12
# Другий елемент 12 це добуток всіх елементів списку numbers, без другого елементу 20
